linux/nothing/33_adb备份软件一键安装.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-09-22 二 13:57 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>安卓一键软件备份-安装</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="rzry" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">安卓一键软件备份-安装</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org062de5b">爬所有的软件包名</a></li>
<li><a href="#orgad77ab0">替换一下</a></li>
<li><a href="#org31b831b">把data/app 提出来</a></li>
<li><a href="#org435d792">可以直接  adb pull</a></li>
<li><a href="#orga13cb93">方法</a></li>
<li><a href="#orgc5bd5ff">设置权限</a></li>
<li><a href="#orgde64d1d">安装</a></li>
<li><a href="#orgbcbf204">搞了个这个 把我分支感染了  就离谱</a></li>
<li><a href="#org7eac438">我真是服了自己</a></li>
</ul>
</div>
</div>
<div class="right">
<a href="https://github.com/rzry" class="fa fa-github"> Edit on GitHub</a>
</div>
<div id="outline-container-org062de5b" class="outline-2">
<h2 id="org062de5b">爬所有的软件包名</h2>
<div class="outline-text-2" id="text-org062de5b">
<p>
adb shell pm list package
</p>

<p>
adb shell pm list packages &gt;&gt; 1.txt
</p>
</div>
</div>

<div id="outline-container-orgad77ab0" class="outline-2">
<h2 id="orgad77ab0">替换一下</h2>
<div class="outline-text-2" id="text-orgad77ab0">
<p>
sed -e 's///g'  1.txt 拿到单独的名字  
</p>


<p>
adb shell pm path com.hpbr.bosszhipin &gt;&gt; package  拿到路径
</p>
</div>
</div>

<div id="outline-container-org31b831b" class="outline-2">
<h2 id="org31b831b">把data/app 提出来</h2>
<div class="outline-text-2" id="text-org31b831b">
<p>
sed -n '\/data\/app/p' package 
</p>
</div>
</div>

<div id="outline-container-org435d792" class="outline-2">
<h2 id="org435d792">可以直接  adb pull</h2>
<div class="outline-text-2" id="text-org435d792">
<pre class="example">
问题   因为  软件 我们 批量导出的时候 

adb pull /data/app/com.google.android.youtube-VnqhGs8cQZrD4S6UAEEioQ==/base.apk ./ 
adb pull /data/app/com.google.android.youtube-VnqhGs8cQZrD4S6UAEEioQ==/split_config.zh.apk ./ 
adb pull /data/app/com.hpbr.bosszhipin-yK6g-htg_HFL4zr4AnDSmQ==/base.apk ./ 
adb pull /data/app/com.google.android.googlequicksearchbox-5IemJHVD9vbt2Cb0M0dPJw==/base.apk ./ 

这会有多个名字一样的软件  这是 7.0 以上的通病 
为了避免这种情况 我们给后面直接重命名自增一个

</pre>
</div>
</div>
<div id="outline-container-orga13cb93" class="outline-2">
<h2 id="orga13cb93">方法</h2>
<div class="outline-text-2" id="text-orga13cb93">
<pre class="example">
给末尾添加 一个 sed    sed 's/$/&amp;sed/g' 4.sh &gt;&gt; 8.sh

然后 以 sed 为关键字 让它自增 
 awk -v RS="sed" '{n+=1;printf $0n}' 8.sh  &gt; 9.sh

 然后再给末尾加一个  .apk  
 sed 's/$/&amp;.apk/g' 9.sh &gt;&gt; 10.sh
</pre>
</div>
</div>
<div id="outline-container-orgc5bd5ff" class="outline-2">
<h2 id="orgc5bd5ff">设置权限</h2>
<div class="outline-text-2" id="text-orgc5bd5ff">
<pre class="example">
chmod  777 10.sh ok 完成了
</pre>
</div>
</div>

<div id="outline-container-orgde64d1d" class="outline-2">
<h2 id="orgde64d1d">安装</h2>
<div class="outline-text-2" id="text-orgde64d1d">
<pre class="example">
使用 tcp 连接 
adb tcpip 5555 

adb connect 192.168.2.150

然后  cp -r 10.sh ./11.sh   
我们处理 11.sh 
awk '{print $NF}' 10.sh &gt;&gt; 11.sh    (拿到11.sh 最后一个值)
设置权限  执行   ok   wait  安装完成吧 

</pre>
</div>
</div>
<div id="outline-container-orgbcbf204" class="outline-2">
<h2 id="orgbcbf204">搞了个这个 把我分支感染了  就离谱</h2>
</div>
<div id="outline-container-org7eac438" class="outline-2">
<h2 id="org7eac438">我真是服了自己</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2020-09-16</p>
<p class="author">Author: rzry</p>
<p class="date">Created: 2020-09-22 二 13:57</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
